Revit 2027 API
ConnectorElement.CreateDuctConnector(Document, DuctSystemType, ConnectorProfileType, Reference) Method
 Create a new duct ConnectorElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ConnectorElement CreateDuctConnector(
	Document document,
	DuctSystemType ductSystemType,
	ConnectorProfileType profileShape,
	Reference planarFace
)
Public Shared Function CreateDuctConnector (
	document As Document,
	ductSystemType As DuctSystemType,
	profileShape As ConnectorProfileType,
	planarFace As Reference
) As ConnectorElement
public:
static ConnectorElement^ CreateDuctConnector(
	Document^ document,
	DuctSystemType ductSystemType,
	ConnectorProfileType profileShape,
	Reference^ planarFace
)
static member CreateDuctConnector :
        document : Document *
        ductSystemType : DuctSystemType *
        profileShape : ConnectorProfileType *
        planarFace : Reference -> ConnectorElement
Parameters
document Document
 The document to add the connector to.
ductSystemType DuctSystemType
 The DuctSystemType of the connector.
profileShape ConnectorProfileType
 The profile shape of the duct.
planarFace Reference
 The planar face to place the connector on.
Return Value
ConnectorElement
 The duct ConnectorElement.
Exceptions
Exception | Condition
ArgumentException |  The reference is not a planar face. -or- document is not a family document.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  Connector creation is not allowed in this family.
Remarks
 Regenerates the document.
See Also
Reference
ConnectorElement Class
CreateDuctConnector Overload
Autodesk.Revit.DB Namespace